#  CA2-Storage Solutions for Big Data, Data Visualization Techniques
## Programme Title: HDip #AI Concepts - Feb 2023 - SB+HCI cohort
## Assignment Title: Integrated Continuous Assessment 2
## Lecturer(s): Muhammad Iqbal, James Garza

#### Student Full Name:	Ciaran Quinlan, Student Number: sbs23098, sbs23098@student.cct.ie
#### Submission Deadline Date: 26th Nov 2023

In [1]:
# DATA PREPARATION NOTEBOOK
## this notebook is to prepare the datasets that I am using for the SSD CA2

In [2]:
# IMPORT the pandas the library
import pandas as pd

# import the warnings file so we can supress unnecessary warnings when running code
import warnings
warnings.filterwarnings('ignore')   # The object 'warnings' is used to call the method 'filterwarnings' and ignore the warnings

In [3]:
# FUNCTIONS - I wrote this for a CA in semester 1.
# This function will rename Columns headings in a given DataFrame, 
# this is easy to use when you have a lot of re-naming or duplicate df's you want to apply same changes to
# call the function with df (target DataFrame), name of columns you want to target,  new columns names
def rename_columns(df, current_names, new_names):
    if len(current_names) != len(new_names):
        raise ValueError("current_names and new_names should have the same length")
    
    mapping = dict(zip(current_names, new_names))
    df = df.rename(columns=mapping)
    return df

In [4]:
# FUNCTIONS - I wrote this for a CA in semester 1.
# This function will Rename row data in given column in a given DataFrame, 
# this is easy to use when you have an array of data for the new colum, ie from a formula 
# call the function with df (target pandas DataFrame), # col_name of column you want to target,  new columns names array 
def rename_row_data(df, col_name, changes):
    for old_val, new_val in changes.items():
        df.loc[df[col_name] == old_val, col_name] = new_val
# FUNCTIONS - I wrote this for a CA in semester 1.
# This function will move a given column in a given DataFrame, to a new position
def move_column(dataframe, column_name, position):
    col = dataframe.pop(column_name)
    dataframe.insert(position, column_name, col)

In [5]:
## I am going to import the irish and USA baby name datasets, 
## normalise the file and write out a merged csv file that i will use for the plots.
## ignore the test lines of code that are commeneted out

In [14]:
# import the  data file for Irish baby names
df_irish_names = pd.read_csv('../Irish_baby_names_count_and_rank.csv')
# import the file for USA baby names
df_usa_names = pd.read_csv('../usa_states_baby_names_count_and_rank.csv')

In [15]:
# TESTING CODE get the number of rows
#num_rows_ire=len(df_irish_names)
#num_rows_ire = "{:,}".format(num_rows_ire)
# print(f"The number of rows in the dataframe 'df_irish_names' is '{num_rows_ire}'")
# get the number of usa rows
#num_rows_usa=len(df_usa_names)
#num_rows_usa = "{:,}".format(num_rows_usa)
#print(f"The number of rows in the dataframe 'df_usa_names' is '{num_rows_usa}'")

In [16]:
# Removing all rows that contain at least one NaN value
# The Irish dataset had a lot of NaNs as the name is recorded as blank if less that 3 people anot being used in that year as a blank
#df_irish_names = df_irish_names.dropna()  # not going to drop the NANs, going to make the zero
#df_usa_names = df_usa_names.dropna()

# Rather than delete the years i will make them zero, filling nan with zero
df_irish_names[['Count', 'Rank']] = df_irish_names[['Count', 'Rank']].fillna(0)
# 
# get the number of rows
num_rows_ire=len(df_irish_names)
num_rows_ire = "{:,}".format(num_rows_ire)

print(f"The number of rows in the dataframe 'df_irish_names' is '{num_rows_ire}'")
# get the number of usa rows
num_rows_usa=len(df_usa_names)
num_rows_usa = "{:,}".format(num_rows_usa)
print(f"The number of rows in the dataframe 'df_usa_names' is '{num_rows_usa}'")

The number of rows in the dataframe 'df_irish_names' is '346,898'
The number of rows in the dataframe 'df_usa_names' is '6,337,734'

In [17]:
# The irish data is 1964 to 2021
# the usa data is 1910 to 2021
# I am going to remove the usa data from 1910 to 1964 for CA2 so it will be easier to plot.

df_usa_names.drop(df_usa_names[(df_usa_names['Year'] >= 1900) & (df_usa_names['Year'] <= 1963)].index, inplace=True)

In [18]:
# I need to get both datasets into this format 
# Year, 
# Names,
# Sex, 
# Count (Number of times the name was given for that year and sex.)/Same as USA Count, 
# Ire-Rank (of the name, including ties. Ireland Only)
# USA-State-Total for the State/Gender/Year
# Country (USA or Ireland)
# State (US State or IRE for Ireland )

In [19]:
# IRELAND DATA PREP
# Display first 5 records
df_irish_names.head()

   Year   Names Sex   Count  Rank
0  1964    Jack   M     0.0   0.0
1  1964    Sean   M   171.0  38.0
2  1964   Conor   M    97.0  56.0
3  1964  Daniel   M   395.0  19.0
4  1964   James   M  1554.0   5.0

In [20]:
# Rename the columns in the Irish Dataframe 
# df_irish_names.rename(columns = ({'Sex': 'Gender'}), inplace=True)
df_irish_names = rename_columns(df_irish_names, 
                            ['Rank', 'Names'], 
                            ['IRE-Rank','Name'])

In [21]:
# Insert the new columns to match it with USA table 
df_irish_names['USA-State-Total'] = 0
df_irish_names['Country'] = 'Ireland'
df_irish_names['State'] = 'IRE'

# Print the result
print(df_irish_names)

        Year     Name Sex   Count  IRE-Rank  USA-State-Total  Country State
0       1964     Jack   M     0.0       0.0                0  Ireland   IRE
1       1964     Sean   M   171.0      38.0                0  Ireland   IRE
2       1964    Conor   M    97.0      56.0                0  Ireland   IRE
3       1964   Daniel   M   395.0      19.0                0  Ireland   IRE
4       1964    James   M  1554.0       5.0                0  Ireland   IRE
...      ...      ...  ..     ...       ...              ...      ...   ...
346893  2021    Vaeda   F     4.0     764.0                0  Ireland   IRE
346894  2021  Viviana   F     3.0     883.0                0  Ireland   IRE
346895  2021   Zariah   F     3.0     883.0                0  Ireland   IRE
346896  2021      Zia   F     3.0     883.0                0  Ireland   IRE
346897  2021     Zoha   F     3.0     883.0                0  Ireland   IRE

[346898 rows x 8 columns]

In [22]:
# USA DATA PREP
# Display first 5 records
df_usa_names.head()

      State Sex  Year   Name  Count  Total  Count_Normalized
15010    OR   F  1964   Lisa    422  13718          0.030763
15011    OR   F  1964  Julie    252  13718          0.018370
15012    OR   F  1964   Mary    251  13718          0.018297
15013    OR   F  1964  Susan    247  13718          0.018006
15014    OR   F  1964  Karen    232  13718          0.016912

In [23]:
#USA COLUMN PREP
# Deleting the 'Count_Normalized' column
del df_usa_names['Count_Normalized']
# add the IRE Rank
df_usa_names['IRE-Rank'] = 0
# Rename the columns in the USA Dataframe 
df_usa_names = rename_columns(df_usa_names, 
                            ['Total',], 
                            ['USA-State-Total'])
# ADD THE COUNTRY
df_usa_names['Country'] = 'USA'

# Move columns to # Year, # Names,# Sex, # Count, # Ire-Rank, # USA-State-Total, # Country, # State (US State or IRE for Ireland )

# Move column 
move_column(df_usa_names, 'Year', 0)
move_column(df_usa_names, 'Name', 1)
move_column(df_usa_names, 'Sex', 2)
move_column(df_usa_names, 'Count', 3)


# Add the IRE-rank column
# Insert the new columns to match it with USA table 
df_usa_names['IRE-Rank'] = 0
move_column(df_usa_names, 'IRE-Rank', 4)

# Rename the columns in the USA Dataframe 
df_usa_names = rename_columns(df_usa_names, 
                            ['Total',], 
                            ['USA-State-Total'])
move_column(df_usa_names, 'USA-State-Total', 5) 

move_column(df_usa_names, 'Country', 6)
move_column(df_usa_names, 'State', 7)
print(df_usa_names)

         Year    Name Sex  Count  IRE-Rank  USA-State-Total Country State
15010    1964    Lisa   F    422         0            13718     USA    OR
15011    1964   Julie   F    252         0            13718     USA    OR
15012    1964    Mary   F    251         0            13718     USA    OR
15013    1964   Susan   F    247         0            13718     USA    OR
15014    1964   Karen   F    232         0            13718     USA    OR
...       ...     ...  ..    ...       ...              ...     ...   ...
6337729  2021  Yeshua   M      5         0             6808     USA    PR
6337730  2021    Zael   M      5         0             6808     USA    PR
6337731  2021   Zahid   M      5         0             6808     USA    PR
6337732  2021  Zariel   M      5         0             6808     USA    PR
6337733  2021    Zyan   M      5         0             6808     USA    PR

[4229781 rows x 8 columns]

In [24]:
# Convert the year, count, rank and us state total column to int
df_irish_names['Year'] = df_irish_names['Year'].astype(int)
df_irish_names['Count'] = df_irish_names['Count'].astype(int)
df_irish_names['IRE-Rank'] = df_irish_names['IRE-Rank'].astype(int)
df_irish_names['USA-State-Total'] = df_irish_names['USA-State-Total'].astype(int)
df_usa_names['Year'] = df_usa_names['Year'].astype(int)
df_usa_names['Count'] = df_usa_names['Count'].astype(int)
df_usa_names['IRE-Rank'] = df_usa_names['IRE-Rank'].astype(int)
df_usa_names['USA-State-Total'] = df_usa_names['USA-State-Total'].astype(int)

print(df_usa_names)
print(df_usa_names.dtypes)

         Year    Name Sex  Count  IRE-Rank  USA-State-Total Country State
15010    1964    Lisa   F    422         0            13718     USA    OR
15011    1964   Julie   F    252         0            13718     USA    OR
15012    1964    Mary   F    251         0            13718     USA    OR
15013    1964   Susan   F    247         0            13718     USA    OR
15014    1964   Karen   F    232         0            13718     USA    OR
...       ...     ...  ..    ...       ...              ...     ...   ...
6337729  2021  Yeshua   M      5         0             6808     USA    PR
6337730  2021    Zael   M      5         0             6808     USA    PR
6337731  2021   Zahid   M      5         0             6808     USA    PR
6337732  2021  Zariel   M      5         0             6808     USA    PR
6337733  2021    Zyan   M      5         0             6808     USA    PR

[4229781 rows x 8 columns]
Year                int32
Name               object
Sex                object
Count               int32
IRE-Rank            int32
USA-State-Total     int32
Country            object
State              object
dtype: object

In [30]:
# All ready now to merge both datasets
# first i will check if i can proceed
if list(df_irish_names.columns) == list(df_usa_names.columns):
    print("The DataFrames have the same columns in the same order")
else:
    print("The DataFrames have different columns or different order")

The DataFrames have the same columns in the same order

In [31]:
# Appending USA to IRE
ca2_dataset_df = pd.concat([df_usa_names, df_irish_names], ignore_index=True)
# get the number of rows
num_rows=len(ca2_dataset_df)
num_rows = "{:,}".format(num_rows)

print(f"The number of rows in the dataframe 'df_irish_names' is '{num_rows_ire}'")
print(f"The number of rows in the dataframe 'df_usa_names' is '{num_rows_usa}'")
print(f"The number of rows in the Merged dataframe 'ca2_dataset_df' is '{num_rows}'")

The number of rows in the dataframe 'df_irish_names' is '346,898'
The number of rows in the dataframe 'df_usa_names' is '6,337,734'
The number of rows in the Merged dataframe 'ca2_dataset_df' is '4,576,679'

In [32]:
# writing the updated Irish and USA datasetd
df_irish_names.to_csv('../irish_names.csv', index=False)
df_usa_names.to_csv('../usa_names.csv', index=False)

# Writing the Merged DataFrame to a CSV file
ca2_dataset_df.to_csv('../ca2_merged_dataset.csv', index=False)

In [33]:
# all done dataset is merged and ready to be used

In [34]:
# I have kept the dataset extra large to comply with the requirement of the assignment to use a large dataset
# Because of the dataset size running on my PC it slows down the processing of pyspark notebooks.

In [36]:
num_unique_names = ca2_dataset_df['Country'].nunique()
print("Number of unique values in the 'country' column:", num_unique_names)
num_unique_names = ca2_dataset_df['State'].nunique()
print("Number of unique values in the 'State' column:", num_unique_names)

Number of unique values in the 'country' column: 2
Number of unique values in the 'State' column: 54